case_09/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application         compressibleInterNoTFoam;

startFrom           latestTime;

startTime           0;

stopAt              endTime;

endTime             0.5;

deltaT              1e-5;

writeControl        adjustableRunTime;

writeInterval       1e-3;

purgeWrite          0;

writeFormat         ascii;

writePrecision      8;

writeCompression    off;

timeFormat          general;

timePrecision       8;

runTimeModifiable   yes;

adjustTimeStep      yes;

maxCo               1;
maxAlphaCo          1;

maxDeltaT           1e-2;



// ************************************************************************* //
